app/controllers/comments_controller.rb

  def create
    comment = Comment.create comment_params do |c|
---
INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "blah"], ["created_at", "2016-05-15 21:30:19.976017"], ["updated_at", "2016-05-15 21:30:19.976017"]]

  def edit
    @comment = Comment.find params[:id]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    t = Comment.find params[:id]
    t.update comment_params
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test4"], ["updated_at", "2016-05-15 21:31:17.418260"], ["id", 2]]

  def destroy
    Comment.find(params[:id]).delete
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]