app/controllers/creatures_controller.rb

  def create
    creature = Creature.create(creature_params)
---
INSERT INTO "creatures" ("description", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Angry monster."], ["name", "Monster"], ["created_at", "2016-05-04 22:27:07.174628"], ["updated_at", "2016-05-04 22:27:07.174628"]]

  def new
      @creature = Creature.new
      @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def edit
    @creature = Creature.find params[:id]
    @tags = Tag.all
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "tags".* FROM "tags"

  def show
    @creature = Creature.find params[:id]
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 4]]

  def update
    c = Creature.find params[:id]
    c.update creature_params
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Cursed fox with nine tails. Touching one will curse you for thousands of years. Pretty but scary."], ["updated_at", "2016-05-04 23:29:20.388606"], ["id", 4]]

  def destroy
    Creature.find(params[:id]).destroy
---
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 2]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 2]]