app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "title", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    post = Post.create(post_params)

SELECT "tags".* FROM "tags"
---
  def new
      @post = Post.new
      @tags = Tag.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
---
  def edit
    @post = Post.find params[:id]
    @tags = Tag.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"
---
  def show
    @post = Post.find params[:id]
    @comments = Comment.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Cute fire pokemon. Here's a pretty long sentence to see how long this post will go."], ["updated_at", "2016-05-15 22:38:10.316920"], ["id", 1]]
---
  def update
    p = Post.find params[:id]
    p.update post_params