app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Fire spirit"], ["created_at", "2016-05-10 18:57:32.132425"], ["updated_at", "2016-05-10 18:57:32.132425"]]
---
  def create
    tag = Tag.create(tag_params)

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @tag = Tag.find params[:id]

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @tag = Tag.find params[:id]

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["name", "Dragon"], ["updated_at", "2016-05-10 18:03:20.130013"], ["id", 1]]
---
  def update
    t = Tag.find params[:id]
    t.update tag_params

DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 2]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 2]]
---
  def destroy
    Tag.find(params[:id]).destroy